using App.Utils;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace App.DAL
{
    /// <summary>
    /// 权限清单（权限是程序内定的，作为枚举进行存储很合适)
    /// </summary>
    /// <remarks>
    /// 用户User-角色Role-权限Permission/Power 三级授权机制
    /// 权限
    ///     系统只根据权限来限制操作，如修改按钮是否可用，删除按钮是否可用等
    ///     编写页面时无需考虑角色
    ///     权限是可以预料且内置的，如产品查看、产品修改、产品新建、产品删除权限
    ///     既然是固定的，可以用枚举来描述，也便于强类型编码，避免编码变更导致权限错乱的情况
    ///     提示：初期也可以简化权限，如系统管理、产品管理；在后期再根据需求拆分为产品新建、产品修改等。
    ///     后期看是否需要简化，直接针对每个模型类，默认提供CRUD权限供角色进行配置
    /// 
    /// 角色
    ///     角色是权限的集合
    ///     角色和权限的关系可在后台进行配置
    ///     角色可以动态增减，可在后台进行配置
    ///     
    /// 用户
    ///     拥有多个角色
    ///     系统可根据用户拥有的角色对应的权限列表，来进行授权操作
    ///     注意：不推荐直接根据角色来授权，会导致逻辑不清晰
    /// </remarks>
    public enum Power : int
    {
        //---------------------------------------------
        // AppPlat 通用权限（000-099）
        //---------------------------------------------
        // 基础框架权限
        [UI("终端访问", "网站")]            Web = 0,
        [UI("终端访问", "小程序")]           MiniProgram = 1,


        //---------------------------------------------
        // 管理相关(0-10)
        //---------------------------------------------
        //[UI("管理", "Admin")]               Admin = 1,          // Admin专用权限，根据需求再细分
        //[UI("管理", "配置员")]              AdminConfig = 2,
        //[UI("管理", "监管员")]              AdminMonitor = 3,
        //[UI("Admin", "开发")]             AdminDevelop = 4,           
        //[UI("Admin", "配置")]             AdminConfig = 5,            
        //[UI("管理", "测试")]                Test = 6,            


        //---------------------------------------------
        // 数据访问权限(11-20)
        //---------------------------------------------
        [UI("数据访问", "全部数据")]        DataAll = 11,
        [UI("数据访问", "仅单位数据")]      DataUnit = 12,
        [UI("数据访问", "仅科室数据")]      DataDept = 13,
        [UI("数据访问", "仅责任数据")]      DataDuty = 14,


        //---------------------------------------------
        // 配置
        //---------------------------------------------
        [UI("配置", "站点配置")]            ConfigSite = 21,
        [UI("配置", "菜单管理")]            ConfigMenu = 22,
        [UI("配置", "序列号维护")]          ConfigSequence = 23,
        [UI("配置", "IP黑名单维护")]        ConfigBlackIP = 24,

        //---------------------------------------------
        // Misc
        //---------------------------------------------
        [UI("配置", "参考网站查看")]          SiteView = 400,
        [UI("配置", "参考网站新增")]          SiteNew = 401,
        [UI("配置", "参考网站修改")]          SiteEdit = 402,
        [UI("配置", "参考网站删除")]          SiteDelete = 403,


        //---------------------------------------------
        // 监管
        //---------------------------------------------
        [UI("监管", "监管")]                Monitor = 30,
        [UI("监管", "日志管理")]            MonitorLog = 31,
        [UI("监管", "在线用户管理")]        MonitorOnline = 32,
        [UI("监管", "消息管理")]            MonitorMessage = 33,
        [UI("监管", "资源管理")]            MonitorRes = 34,


        [UI("反馈", "查看")]                FeedBackView = 40,
        [UI("反馈", "新增")]                FeedBackNew = 41,
        [UI("反馈", "修改")]                FeedBackEdit = 42,
        [UI("反馈", "删除")]                FeedBackDelete = 43,
        [UI("反馈", "派发")]                FeedBackDispatch = 45,           
        [UI("反馈", "处理")]                FeedBackHandle = 46,           


        //---------------------------------------------
        // 用户、角色、组织
        //---------------------------------------------
        [UI("用户", "用户查看")]            UserView = 50,
        [UI("用户", "用户新增")]            UserNew = 51,
        [UI("用户", "用户修改")]            UserEdit = 52,
        [UI("用户", "用户删除")]            UserDelete = 53,
        [UI("用户", "用户密码重置")]         UserResetPassword = 54,

        [UI("角色", "角色查看")]            RoleView = 55,
        [UI("角色", "角色新增")]            RoleNew = 56,
        [UI("角色", "角色修改")]            RoleEdit = 57,
        [UI("角色", "角色删除")]            RoleDelete = 58,


        [UI("组织", "组织查看")]        OrgView = 60,
        [UI("组织", "组织新增")]        OrgNew = 61,
        [UI("组织", "组织修改")]        OrgEdit = 62,
        [UI("组织", "组织删除")]        OrgDelete = 63,



        //---------------------------------------------
        // OA (200)
        //---------------------------------------------
        [UI("公告", "公告查看")]               AnnounceView = 70,
        [UI("公告", "公告新增")]               AnnounceNew = 71,
        [UI("公告", "公告修改")]               AnnounceEdit = 72,
        [UI("公告", "公告删除")]               AnnounceDelete = 73,


        [UI("评论", "评论查看")]               CommentView = 210,
        [UI("评论", "评论新增")]               CommentNew = 211,
        [UI("评论", "评论修改")]               CommentEdit = 212,
        [UI("评论", "评论删除")]               CommentDelete = 213,



        //---------------------------------------------
        // 财务
        //---------------------------------------------
        [UI("资产", "资产查看")]               AssetView = 200,
        [UI("资产", "资产新增")]               AssetNew = 201,
        [UI("资产", "资产修改")]               AssetEdit = 202,
        [UI("资产", "资产删除")]               AssetDelete = 203,
        [UI("资产", "资产类别管理")]           AssetCategoryEdit = 205,

        [UI("项目", "项目查看")]               ProjectView = 230,
        [UI("项目", "项目新增")]               ProjectNew = 231,
        [UI("项目", "项目修改")]               ProjectEdit = 232,
        [UI("项目", "项目删除")]               ProjectDelete = 233,

        [UI("预算", "预算查看")]               BudgetView = 240,
        [UI("预算", "预算新增")]               BudgetNew = 241,
        [UI("预算", "预算修改")]               BudgetEdit = 242,
        [UI("预算", "预算删除")]               BudgetDelete = 243,
        [UI("预算", "预算类别管理")]           BudgetTypeEdit = 245,




        //---------------------------------------------
        // CMS
        //---------------------------------------------
        [UI("内容管理", "内容查看")]               ArticleView = 250,
        [UI("内容管理", "内容新增")]               ArticleNew = 251,
        [UI("内容管理", "内容修改")]               ArticleEdit = 252,
        [UI("内容管理", "内容删除")]               ArticleDelete = 253,
        [UI("内容管理", "内容目录管理")]           ArticleDirEdit = 255,




        //---------------------------------------------
        // GIS (270)
        //---------------------------------------------
        [UI("GIS", "点位查看")]             GisGeometryView = 270,
        [UI("GIS", "点位新增")]             GisGeometryNew = 271,
        [UI("GIS", "点位修改")]             GisGeometryEdit = 272,
        [UI("GIS", "点位删除")]             GisGeometryDelete = 273,

        [UI("GIS", "场景查看")]             GisSceneView = 275,
        [UI("GIS", "场景新增")]             GisSceneNew = 276,
        [UI("GIS", "场景修改")]             GisSceneEdit = 277,
        [UI("GIS", "场景删除")]             GisSceneDelete = 278,


        //---------------------------------------------
        // 检查 (300)
        //---------------------------------------------
        [UI("安全生产", "检查对象查看")]           CheckObjectView = 300,
        [UI("安全生产", "检查对象新增")]           CheckObjectNew = 301,
        [UI("安全生产", "检查对象修改")]           CheckObjectEdit = 302,
        [UI("安全生产", "检查对象删除")]           CheckObjectDelete = 304,
        [UI("安全生产", "检查对象导出")]           CheckObjectExport = 305,
        [UI("安全生产", "检查对象导入")]           CheckObjectImport = 306,
    
        [UI("安全生产", "检查任务查看")]           CheckTaskView = 310,
        [UI("安全生产", "检查任务新增")]           CheckTaskNew = 311,
        [UI("安全生产", "检查任务修改")]           CheckTaskEdit = 312,
        [UI("安全生产", "检查任务删除")]           CheckTaskDelete = 313,

        [UI("安全生产", "检查记录查看")]           CheckView = 320,
        [UI("安全生产", "检查记录新增")]           CheckNew = 321,
        [UI("安全生产", "检查记录修改")]           CheckEdit = 322,
        [UI("安全生产", "检查记录删除")]           CheckDelete = 323,

        [UI("安全生产", "隐患查看")]               CheckHazardView = 330,
        [UI("安全生产", "隐患修改")]               CheckHazardEdit = 331,
        [UI("安全生产", "隐患删除")]               CheckHazardDelete = 332,

        [UI("安全生产", "检查表查看")]           CheckSheetView = 340,
        [UI("安全生产", "检查表新增")]           CheckSheetNew = 341,
        [UI("安全生产", "检查表修改")]           CheckSheetEdit = 342,
        [UI("安全生产", "检查表删除")]           CheckSheetDelete = 343,

        [UI("安全生产", "检查点查看")]           CheckPointView = 350,
        [UI("安全生产", "检查点新增")]           CheckPointNew = 351,
        [UI("安全生产", "检查点修改")]           CheckPointEdit = 352,
        [UI("安全生产", "检查点删除")]           CheckPointDelete = 353,





        //---------------------------------------------
        // CRM
        //---------------------------------------------
        [UI("联系人", "联系人查看")]           ContactView = 500,
        [UI("联系人", "联系人新增")]           ContactNew = 501,
        [UI("联系人", "联系人修改")]           ContactEdit = 502,
        [UI("联系人", "联系人删除")]           ContactDelete = 503,

        [UI("联系人", "联系人目录查看")]     ContactMenuView = 510,
        [UI("联系人", "联系人目录新增")]     ContactMenuNew = 511,
        [UI("联系人", "联系人目录修改")]     ContactMenuEdit = 512,
        [UI("联系人", "联系人目录删除")]     ContactMenuDelete = 513,



        //---------------------------------------------
        // KB
        //---------------------------------------------
        [UI("知识库", "文档查看")]     KbArticleView = 600,
        [UI("知识库", "文档新增")]     KbArticleNew = 601,
        [UI("知识库", "文档修改")]     KbArticleEdit = 602,
        [UI("知识库", "文档删除")]     KbArticleDelete = 603,

        [UI("知识库", "目录查看")]     KbMenuView = 610,
        [UI("知识库", "目录新增")]     KbMenuNew = 611,
        [UI("知识库", "目录修改")]     KbMenuEdit = 612,
        [UI("知识库", "目录删除")]     KbMenuDelete = 613,

        //---------------------------------------------
        // AI
        //---------------------------------------------
        [UI("AI", "AI聊天")]              AIChat = 700,
        [UI("AI", "AI配置")]              AIConfig = 701,


        //---------------------------------------------
        // Task
        //---------------------------------------------
        [UI("交办任务", "任务查看")]               TaskView = 800,
        [UI("交办任务", "任务新增")]               TaskNew = 801,
        [UI("交办任务", "任务修改")]               TaskEdit = 802,
        [UI("交办任务", "任务删除")]               TaskDelete = 803,


        [UI("交办任务", "事件查看")]               EventView = 810,
        [UI("交办任务", "事件新增")]               EventNew = 811,
        [UI("交办任务", "事件修改")]               EventEdit = 812,
        [UI("交办任务", "事件删除")]               EventDelete = 813,
        [UI("交办任务", "事件类别管理")]           EventTypeEdit = 815,


        //---------------------------------------------
        // 报表相关权限（900-999）
        //---------------------------------------------
        [UI("报表", "报表查看")]        ReportView = 900,
        [UI("报表", "报表新增")]        ReportNew = 901,
        [UI("报表", "报表管理")]        ReportEdit = 902,
        [UI("报表", "报表删除")]        ReportDelete = 903,
    }
}
