using App.Utils;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace App.DAL
{
    /// <summary>
    /// 权限清单（权限是程序内定的，作为枚举进行存储很合适)
    /// </summary>
    /// <remarks>
    /// 用户User-角色Role-权限Permission/Power 三级授权机制
    /// 权限
    ///     系统只根据权限来限制操作，如修改按钮是否可用，删除按钮是否可用等
    ///     编写页面时无需考虑角色
    ///     权限是可以预料且内置的，如产品查看、产品修改、产品新建、产品删除权限
    ///     既然是固定的，可以用枚举来描述，也便于强类型编码，避免编码变更导致权限错乱的情况
    ///     提示：初期也可以简化权限，如系统管理、产品管理；在后期再根据需求拆分为产品新建、产品修改等。
    ///     后期看是否需要简化，直接针对每个模型类，默认提供CRUD权限供角色进行配置
    /// 
    /// 角色
    ///     角色是权限的集合
    ///     角色和权限的关系可在后台进行配置
    ///     角色可以动态增减，可在后台进行配置
    ///     
    /// 用户
    ///     拥有多个角色
    ///     系统可根据用户拥有的角色对应的权限列表，来进行授权操作
    ///     注意：不推荐直接根据角色来授权，会导致逻辑不清晰
    /// </remarks>
    public enum Power : int
    {
        //---------------------------------------------
        // AppPlat 通用权限（000-099）
        //---------------------------------------------
        // 基础框架权限
        [UI("Core", "访问网站")]            Web = 0,


        //---------------------------------------------
        // 管理相关(0-19)
        //---------------------------------------------
        //[UI("管理", "Admin")]               Admin = 1,          // Admin专用权限，根据需求再细分
        //[UI("管理", "配置员")]              AdminConfig = 2,
        //[UI("管理", "监管员")]              AdminMonitor = 3,
        //[UI("Admin", "开发")]             AdminDevelop = 4,           
        //[UI("Admin", "配置")]             AdminConfig = 5,            
        [UI("管理", "测试")]                Test = 6,            



        //---------------------------------------------
        // 配置
        //---------------------------------------------
        [UI("配置", "站点配置")]            ConfigSite = 21,
        [UI("配置", "菜单管理")]            ConfigMenu = 22,
        [UI("配置", "序列号维护")]          ConfigSequence = 23,
        [UI("配置", "AI配置")]              ConfigAI = 24,


        //---------------------------------------------
        // 监管
        //---------------------------------------------
        [UI("监管", "监管")]                Monitor = 30,
        [UI("监管", "日志管理")]            MonitorLog = 31,
        [UI("监管", "在线用户管理")]        MonitorOnline = 32,
        [UI("监管", "消息管理")]            MonitorMessage = 33,
        [UI("监管", "资源管理")]            MonitorRes = 34,
        [UI("监管", "IP黑名单维护")]        MonitorIP = 35,



        //---------------------------------------------
        // 运维（网站配置、日志、性能、监控等）
        //---------------------------------------------
        [UI("反馈", "新增")]                FeedBackNew = 40,
        [UI("反馈", "查看")]                FeedBackView = 41,
        [UI("反馈", "修改")]                FeedBackEdit = 42,
        [UI("反馈", "删除")]                FeedBackDelete = 43,
                                           
        [UI("反馈", "派发")]                FeedBackDispatch = 45,           
        [UI("反馈", "处理")]                FeedBackHandle = 46,           


        //---------------------------------------------
        // 用户相关
        //---------------------------------------------
        [UI("用户", "用户新增")]            UserNew = 50,
        [UI("用户", "用户浏览")]            UserView = 51,
        [UI("用户", "用户修改")]            UserEdit = 52,
        [UI("用户", "用户删除")]            UserDelete = 53,
        [UI("用户", "用户密码管理")]         UserPassword = 54,

        //---------------------------------------------
        // 橘色相关
        //---------------------------------------------
        [UI("角色", "角色新增")]            RoleNew = 55,
        [UI("角色", "角色管理")]            RoleEdit = 56,
        [UI("角色", "角色权限管理")]        RolePowerEdit = 57,
        [UI("角色", "角色用户管理")]        RoleUserEdit = 58,
        [UI("角色", "角色浏览")]            RoleView = 59,
        [UI("角色", "角色删除")]            RoleDelete = 590,


        //---------------------------------------------
        // 基础数据
        //---------------------------------------------
        [UI("组织", "组织新增")]        OrgNew = 60,
        [UI("组织", "组织查看")]        OrgView = 61,
        [UI("组织", "组织修改")]        OrgEdit = 62,
        [UI("组织", "组织删除")]        OrgDelete = 63,


        //---------------------------------------------
        // 公告（70-79）
        //---------------------------------------------
        [UI("公告", "公告新增")]               AnnounceNew = 70,
        [UI("公告", "公告查看")]               AnnounceView = 71,
        [UI("公告", "公告修改")]               AnnounceEdit = 72,
        [UI("公告", "公告删除")]               AnnounceDelete = 73,
        

        //---------------------------------------------
        // 厂商（80-89）
        //---------------------------------------------
        [UI("厂商", "厂商新增")]               CompanyNew = 80,
        [UI("厂商", "厂商查看")]               CompanyView = 81,
        [UI("厂商", "厂商修改")]               CompanyEdit = 82,
        [UI("厂商", "厂商删除")]               CompanyDelete = 83,


        //---------------------------------------------
        // OA (200)
        //---------------------------------------------
        [UI("资产", "资产新增")]               AssetNew = 200,
        [UI("资产", "资产查看")]               AssetView = 201,
        [UI("资产", "资产修改")]               AssetEdit = 202,
        [UI("资产", "资产删除")]               AssetDelete = 203,
        [UI("资产", "资产类别管理")]           AssetCategoryEdit = 205,

        [UI("评论", "评论新增")]               CommentNew = 210,
        [UI("评论", "评论查看")]               CommentView = 211,
        [UI("评论", "评论修改")]               CommentEdit = 212,
        [UI("评论", "评论删除")]               CommentDelete = 213,

        [UI("事件", "事件新增")]               EventNew = 220,
        [UI("事件", "事件查看")]               EventView = 221,
        [UI("事件", "事件修改")]               EventEdit = 222,
        [UI("事件", "事件删除")]               EventDelete = 223,

        [UI("事件", "事件类别管理")]           EventTypeEdit = 225,

        [UI("项目", "项目新增")]               ProjectNew = 230,
        [UI("项目", "项目查看")]               ProjectView = 231,
        [UI("项目", "项目修改")]               ProjectEdit = 232,
        [UI("项目", "项目删除")]               ProjectDelete = 233,

        [UI("预算", "预算新增")]               BudgetNew = 240,
        [UI("预算", "预算查看")]               BudgetView = 241,
        [UI("预算", "预算修改")]               BudgetEdit = 242,
        [UI("预算", "预算删除")]               BudgetDelete = 243,
        [UI("预算", "预算类别管理")]           BudgetTypeEdit = 245,

        [UI("文档", "文档新增")]               ArticleNew = 250,
        [UI("文档", "文档查看")]               ArticleView = 251,
        [UI("文档", "文档修改")]               ArticleEdit = 252,
        [UI("文档", "文档删除")]               ArticleDelete = 253,
        [UI("文档", "文档目录管理")]           ArticleDirEdit = 255,

        [UI("任务", "任务新增")]               TaskNew = 260,
        [UI("任务", "任务查看")]               TaskView = 261,
        [UI("任务", "任务修改")]               TaskEdit = 262,
        [UI("任务", "任务删除")]               TaskDelete = 263,

        //---------------------------------------------
        // GIS (270)
        //---------------------------------------------
        [UI("GIS", "GIS新增")]               GisRegionNew = 270,
        [UI("GIS", "GIS查看")]               GisRegionView = 271,
        [UI("GIS", "GIS修改")]               GisRegionEdit = 272,
        [UI("GIS", "GIS删除")]               GisRegionDelete = 273,
        [UI("检查", "检查对象新增")]           CheckObjectNew = 300,
        [UI("检查", "检查对象查看")]           CheckObjectView = 301,
        [UI("检查", "检查对象修改")]           CheckObjectEdit = 302,
        [UI("检查", "检查对象删除")]           CheckObjectDelete = 303,

        [UI("检查", "检查任务新增")]           CheckTaskNew = 310,
        [UI("检查", "检查任务查看")]           CheckTaskView = 311,
        [UI("检查", "检查任务修改")]           CheckTaskEdit = 312,
        [UI("检查", "检查任务删除")]           CheckTaskDelete = 313,

        [UI("检查", "检查记录新增")]           CheckLogNew = 320,
        [UI("检查", "检查记录查看")]           CheckLogView = 321,
        [UI("检查", "检查记录修改")]           CheckLogEdit = 322,
        [UI("检查", "检查记录删除")]           CheckLogDelete = 323,

        [UI("检查", "隐患查看")]               CheckHazardView = 331,
        [UI("检查", "隐患修改")]               CheckHazardEdit = 332,
        [UI("检查", "隐患删除")]               CheckHazardDelete = 333,

        [UI("检查", "检查表新增")]           CheckSheetNew = 340,
        [UI("检查", "检查表查看")]           CheckSheetView = 341,
        [UI("检查", "检查表修改")]           CheckSheetEdit = 342,
        [UI("检查", "检查表删除")]           CheckSheetDelete = 343,


        //---------------------------------------------
        // 报表相关权限（900-999）
        //---------------------------------------------
        /*
        [UI("报表", "报表")]            Report = 900,      // 报表管理大权限，根据需要再细分
        [UI("报表", "报表新增")]        ReportNew = 901,
        [UI("报表", "报表查看")]        ReportView = 902,
        [UI("报表", "报表管理")]        ReportEdit = 903,
        [UI("报表", "报表删除")]        ReportDelete = 904,
        */
    }
}
